---
kind: property
id: P:Autodesk.Revit.DB.Transform2D.BasisU
source: html/2641df76-4f81-d1bb-0086-a621dd89ed5b.htm
---
# Autodesk.Revit.DB.Transform2D.BasisU Property

The image of (1, 0) under OfVector(UV) .

## Syntax (C#)
```csharp
public UV BasisU { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null